tutorials/oldd/eulerVortex.simple.enforced/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;//0.001;

vertices
(
 (-1 1 0)
 (-1 .1 0)  //x2
 (-.1 .1 0)   //x2
 (.1 .1 0)   //x3
 (1 .1 0)     //x3
 (1 1 0)   //5
 (-1 1 0.1)
 (-1 .1 0.1)       //x2
 (-.1 .1 0.1)       //x2
 (.1 .1 0.1)   //x3
 (1 .1 0.1)   //x3
 (1 1 0.1)  //11
 //
 (-1 -.1 0)   //x3
 (-.1 -.1 0)   //x3
 (.1 -.1 0)   //x3
 (1 -.1 0)  //15    //x3
 (1 -1 0)
 (-1 -1 0)
 (-1 -.1 0.1)  //x2
 (-.1 -.1 0.1)   //x2
 (.1 -.1 0.1)
 (1 -.1 0.1)
 (1 -1 0.1)
 (-1 -1 0.1) //23
);

blocks
(
 hex (0 1 2 3 4 5 6 7 8 9 10 11) (10 10 2) simpleGrading (1 1 1)
 hex (1 2 18 19) (10 10 2) simpleGrading (1 1 1)
 hex (3 4 14 15 12 13 9 10) (10 10 2) simpleGrading (1 1 1)
 hex (12 13 14 15 16 17 18 19 20 21 22 23) (10 10 2) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inbound
    {
        type wall;
        faces
        (
            (0 1 9 8)
        );
    }
    outbound
    {
        type patch;
        faces
        (
            (3 2 10 11)
        );
    }
    topbottom
    {
        type wall;
        faces
        (
            (0 3 11 8)
            (1 2 10 9)
        );
    }
    hole
    {
      type wall;
      faces
      (
            (4 7 15 12)
            (4 5 13 12)
	    (7 6 14 15)
	    (5 6 14 13)
      )
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
